app/Controllers/ProdukController.php

    public function detail($id)
    {
        $product = $this->product->find($id);
---
SELECT *
FROM `product`
WHERE `product`.`id` = '2'