app/Controllers/TransaksiController.php

    public function checkout()
    {
        $cartItems = $this->cart->contents();
        if (empty($cartItems)) {
            session()->setFlashdata('success', 'Keranjang kosong, tidak bisa checkout.');
            return redirect()->to(base_url('keranjang'));
        }

        $productModel = new \App\Models\ProductModel();
        $transactionModel = new \App\Models\TransactionModel();
        $transactionDetailModel = new \App\Models\TransactiondetailModel();

        // Start transaction
        $db = \Config\Database::connect();
        $db->transStart();

        // Create transaction record
        $transactionData = [
            'username'    => session()->get('username'),
            'total_harga' => $this->cart->total(),
            'created_at'  => date('Y-m-d H:i:s'),
            'updated_at'  => date('Y-m-d H:i:s')
        ];
        $transactionModel->insert($transactionData);
        $transactionId = $transactionModel->getInsertID();

        // For each cart item, create detail and update stock
        foreach ($cartItems as $item) {
            // Get current stock
            $product = $productModel->find($item['id']);
            if ($product && $product['jumlah'] >= $item['qty']) {
                // Subtract stock
                $productModel->update($item['id'], [
                    'jumlah' => $product['jumlah'] - $item['qty']
                ]);
                // Insert transaction detail
                $transactionDetailModel->insert([
                    'transaction_id' => $transactionId,
                    'product_id'     => $item['id'],
                    'jumlah'         => $item['qty'],
                    'diskon'         => 0,
                    'subtotal_harga' => $item['subtotal'],
                    'created_at'     => date('Y-m-d H:i:s'),
                    'updated_at'     => date('Y-m-d H:i:s')
                ]);
---
INSERT INTO `transaction` (`username`, `total_harga`, `created_at`, `updated_at`) VALUES ('BagusYulianto', 800000, '2025-07-10 03:11:50', '2025-07-10 03:11:50')
SELECT *
FROM `product`
WHERE `product`.`id` = '2'
UPDATE `product` SET `jumlah` = 54
WHERE `product`.`id` IN ('2')
INSERT INTO `transaction_detail` (`transaction_id`, `product_id`, `jumlah`, `diskon`, `subtotal_harga`, `created_at`, `updated_at`) VALUES (4, '2', 2, 0, 800000, '2025-07-10 03:11:50', '2025-07-10 03:11:50')

    public function history()
    {
        // Only allow admin
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/')->with('error', 'Akses ditolak.');
        }

        $transactionModel = new \App\Models\TransactionModel();
        $transactionDetailModel = new \App\Models\TransactiondetailModel();
        $productModel = new \App\Models\ProductModel();

        $transactions = $transactionModel->findAll();
        foreach ($transactions as &$trx) {
            $trx['details'] = $transactionDetailModel->where('transaction_id', $trx['id'])->findAll();
            foreach ($trx['details'] as &$detail) {
                $product = $productModel->find($detail['product_id']);
---
SELECT *
FROM `transaction`
SELECT *
FROM `transaction_detail`
WHERE `transaction_id` = '4'
SELECT *
FROM `product`
WHERE `product`.`id` = '2'